#include "serverWindow.h"

#include <QApplication>
#include <QTextCodec>

/*! \mainpage Клиент-серверное приложение для хранения записной книжки
 *
 * \section main_info Основная информация
 *
 * Данное приложение разработано для хранения телефонных контактов и удобной работы с ними.
 * Клиент-серверная архитектура позволяет нескольким пользователям работать с одним и тем же
 * справочником одновременно.
 *
 * \section client_info Клиентская часть
 *
 * Клиентское приложение состоит из трёх основных окон: вывода списка записей, вывода полной информации о контакте
 * и добавления/редактирования контакта.
 *
 * \subsection phone_list Список контактов
 *
 * Данное окно включает область для вывода списка контактов, кнопку добавления нового контакта и
 * поисковую строку.
 *
 * \image html numbersList.png width=250cm
 *
 *
 * \subsection show_contact Полная информация о контакте
 *
 * Окно выводит на экран полную информацию о контакте (включая дополнительную информацию, такую как
 * email, адрес, место работы и дата рождения). Кроме того, есть кнопка редактирования контакта.
 *
 * \image html showContact.png width=450cm
 *
 * \subsection add_edit_contact Добавление/редактирование контакта
 *
 * Окно включает в себя области для ввода информации по контакту. Окно видоизменяется
 * в соответсвтии с необходимым функционалом (добавление или редактирование).
 *
 * \image html addContact.png width=450cm
 * \image html editContact.png width=450cm
 *
 * \section server_info Серверная часть
 *
 * Серверное приложение состоит из одного окна, в котором отображается лог событий. Сервер отвечает за предоставление
 * информации о контактах пользователям и осуществляет действия над файлом в соответсвии с поступающими запросами.
 *
 * \image html server.png width=250cm
 */

int main(int argc, char *argv[])
{
    QTextCodec* codec = QTextCodec::codecForName("UTF-8");
    QTextCodec::setCodecForLocale(codec);

    QApplication a(argc, argv);
    ServerWindow w;
    w.show();
    return a.exec();
}
